In [1]:
import pandas as pd

In [4]:
series=pd.Series(["toyota","honda","BMW"])

In [5]:
series

0    toyota
1     honda
2       BMW
dtype: object

In [6]:
print(series)

0    toyota
1     honda
2       BMW
dtype: object

In [7]:
#series-1D

colors=pd.Series(["red","blue","yellow"])
colors

0       red
1      blue
2    yellow
dtype: object

In [8]:
#Dataframe-2D

car_data=pd.DataFrame({"car make":series,"color":colors})
car_data

  car make   color
0   toyota     red
1    honda    blue
2      BMW  yellow

In [9]:
car_sales=pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [11]:
car_sales.to_csv("exported_car_sales.csv",index =False)

In [12]:
exported_car_sales=pd.read_csv("exported_car_sales.csv")

In [13]:
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00